{
  "steps": [
    {
      "act": 1,
      "step": 1,
      "substeps": [
        {
          "content": "Kill Hillock"
        }
      ],
      "quest": "Enemy at The Gate"
    },
    {
      "act": 1,
      "step": 2,
      "substeps": [
        {
          "content": "Grab Coast waypoint, go to Mud Flats"
        }
      ]
    },
    {
      "act": 1,
      "step": 3,
      "substeps": [
        {
          "content": "In Mudflats get 3 eggs and go to Submerged Passage, grab waypoint"
        }
      ],
      "quest": "Breaking some Eggs"
    },
    {
      "act": 1,
      "step": 4,
      "substeps": [
        {
          "content": "Go to Coast Waypoint, head to Tidal Island and kill Hailrake"
        }
      ],
      "quest": "Mercy Mission"
    },
    {
      "act": 1,
      "step": 5,
      "substeps": [
        {
          "content": "Back to Submerged Passage, go to the Ledge"
        },
        {
          "content": "Grab Waypoint, go to the Climb"
        },
        {
          "content": "Go to Lower Prison, grab Waypoint"
        }
      ]
    },
    {
      "act": 1,
      "step": 6,
      "substeps": [
        {
          "content": "Back to Submerged Passage, go kill Dweller of the Deeps"
        },
        {
          "content": "Back to town grab skillpoint"
        }
      ],
      "quest": "The Dweller of the Deep"
    },
    {
      "act": 1,
      "step": 7,
      "substeps": [
        {
          "content": "Take waypoint back to Lower Prison"
        },
        {
          "content": "Finish Labyrinth"
        },
        {
          "content": "Go to Warden's Quarter then Warden's Chamber and kill Brutus"
        }
      ]
    },
    {
      "act": 1,
      "step": 8,
      "substeps": [
        {
          "content": "Grab Prisoner's Gate waypoint, back to town to grab gems if necessary"
        }
      ],
      "quest": "The Caged Brute"
    },
    {
      "act": 1,
      "step": 9,
      "substeps": [
        {
          "content": "Back to Prisoner's Gate, go to Ship Graveyard, grab waypoint"
        }
      ]
    },
    {
      "act": 1,
      "step": 10,
      "substeps": [
        {
          "content": "Go to Ship Graveyard Cave, grab Allflame"
        }
      ]
    },
    {
      "act": 1,
      "step": 11,
      "substeps": [
        {
          "content": "Go to Cavern of Wrath, get waypoint"
        },
        {
          "content": "Take waypoint to Ship Graveyard, kill Fairgraves"
        },
        {
          "content": "Back to town, get Skillpoint from Bestel and maybe gems from Nessa"
        }
      ],
      "quest": "The Siren's Cadence"
    },
    {
      "act": 1,
      "step": 12,
      "substeps": [
        {
          "content": "Take waypoint to Cavern of Wrath, go to Cavern of Anger"
        },
        {
          "content": "Exit to Merveil's Lair and kill Merveil."
        }
      ]
    },
    {
      "act": 1,
      "step": 13,
      "substeps": [
        {
          "content": "Exit to Act 2 and run through zone to enter the Forest Encampment."
        }
      ]
    },
    {
      "act": 2,
      "step": 14,
      "substeps": [
        {
          "content": "Go right to the Old Fields"
        },
        {
          "content": "Go to the Den"
        },
        {
          "content": "Kill the White Beast"
        },
        {
          "content": "If you want return to town for your second Quicksilver Flask"
        }
      ],
      "quest": "The Great White Beast"
    },
    {
      "act": 2,
      "step": 15,
      "substeps": [
        {
          "content": "Go right in the Old Fields to the Crossroads"
        },
        {
          "content": "Get waypoint in the middle of the zone"
        },
        {
          "content": "Go right to the Broken Brige"
        },
        {
          "content": "Find and Kill Kraityn"
        }
      ]
    },
    {
      "act": 2,
      "step": 16,
      "substeps": [
        {
          "content": "Back to Crossroads and down to Fellshrine Ruins"
        },
        {
          "content": "Enter the Crypt"
        },
        {
          "content": "Do Trial of Ascendancy in Crypt Level 1"
        }
      ]
    },
    {
      "act": 2,
      "step": 17,
      "substeps": [
        {
          "content": "Head left into the Riverways"
        },
        {
          "content": "Grab waypoint and go up into the Wetlands"
        }
      ]
    },
    {
      "act": 2,
      "step": 18,
      "substeps": [
        {
          "content": "Find and kill Oak"
        },
        {
          "content": "Grab waypoint and take waypoint back to Riverways"
        }
      ]
    },
    {
      "act": 2,
      "step": 19,
      "substeps": [
        {
          "content": "Go left into Western Forest, do the following 3 in any order"
        },
        {
          "content": "Find and help/kill Alira"
        },
        {
          "content": "Kill Blackguards at the and of the road. Use Thaumatic Seal to open Exit to Act 1"
        },
        {
          "content": "Find the Weaver's Nest, enter and kill the Weaver"
        }
      ],
      "quest": "Deal with the Bandits"
    },
    {
      "act": 2,
      "step": 20,
      "substeps": [
        {
          "content": "Back to town, take waypoint to Act 1 Lioneye's Watch"
        },
        {
          "content": "Get Skillpoint from Bestel"
        }
      ],
      "quest": "The Way Forward"
    },
    {
      "act": 2,
      "step": 21,
      "substeps": [
        {
          "content": "Back to town in Act 2, killing Weaver should have unlocked some gems from Yeena"
        }
      ],
      "quest": "Sharp and Cruel"
    },
    {
      "act": 2,
      "step": 22,
      "substeps": [
        {
          "content": "Take the waypoint to the Crossroads and go up into Chamber of Sins"
        },
        {
          "content": "Finish your Labyrinth Trial in the Chamber of Sins level 2"
        },
        {
          "content": "Find and kill Fidelitas and pick up the Baleful Gem"
        },
        {
          "content": "Go back to town for skill gems if any of your build are unlocked with the quest Intruders in Black"
        }
      ],
      "quest": "Intruders in Black"
    },
    {
      "act": 2,
      "step": 23,
      "substeps": [
        {
          "content": "Gems from the quest The Root of the Problem are now unlocked at Yeena, check her if your build needs any"
        }
      ],
      "quest": "The Root of the Problem"
    },
    {
      "act": 2,
      "step": 24,
      "substeps": [
        {
          "content": "Take the waypoint to the Wetlands"
        },
        {
          "content": "Poison the Tree and enter the Vaal Ruins"
        },
        {
          "content": "Go through Vaal Ruins to enter Northern Forest"
        }
      ]
    },
    {
      "act": 2,
      "step": 25,
      "substeps": [
        {
          "content": "Travel through Northern Forest, don't enter Dread Thicket"
        },
        {
          "content": "Enter and run through the Caverns"
        },
        {
          "content": "Ascend the Vaal pyramid and kill the Act 2 boss"
        },
        {
          "content": "Exit into Act 3"
        }
      ]
    },
    {
      "act": 3,
      "step": 26,
      "substeps": [
        {
          "content": "Find the Blackguards and kill them to rescue Clarissa."
        },
        {
          "content": " Make sure that you speak with Clarissa before running off."
        },
        {
          "content": "Enter the Sarn Encampment. This is always found in the upper left part of the area."
        }
      ]
    },
    {
      "act": 3,
      "step": 27,
      "substeps": [
        {
          "content": "Exit into the Slums."
        },
        {
          "content": "Find the Crematorium and grab waypoint."
        },
        {
          "content": "Find the Labyrinth trial in the Crematorium and complete it."
        },
        {
          "content": "Find Piety and defeat her. Grab Tolman's Bracelet"
        },
        {
          "content": "Bring it to Clarissa in town to get Sewer Keys"
        }
      ],
      "quest": "Lost in Love"
    },
    {
      "act": 3,
      "step": 28,
      "substeps": [
        {
          "content": "Exit into the Slums again."
        },
        {
          "content": "Find the Sewer graiting and enter the sewers."
        },
        {
          "content": "Locate the three Platinum Busts. There is always one before the Waypoint, and two after it."
        },
        {
          "content": "The Busts unlock a skillpoint so return them when you have an opportunity to go back to town."
        },
        {
          "content": "Exit into the Marketplace and grab the waypoint"
        }
      ]
    },
    {
      "act": 3,
      "step": 29,
      "substeps": [
        {
          "content": "Up and right of the waypoint are the Catacombs."
        },
        {
          "content": "Enter and complete the Labyrinth Trial."
        },
        {
          "content": "Go back to Marketplace, e.g. via logout or portal back to town and using the waypoint."
        }
      ]
    },
    {
      "act": 3,
      "step": 30,
      "substeps": [
        {
          "content": "Go to the Battlefront and find the waypoint around the middle of the area."
        },
        {
          "content": "Down left from the waypoint is the Ribbon Spool for a quest."
        },
        {
          "content": "Go to the Docks, they are usually at the upper left of the area."
        }
      ]
    },
    {
      "act": 3,
      "step": 30,
      "substeps": [
        {
          "content": "In the Docks go find the Thaumatic Sulphite from the Supply Container."
        },
        {
          "content": "If you want look for the waypoint, otherwise log out or portal back to town."
        }
      ]
    },
    {
      "act": 3,
      "step": 31,
      "substeps": [
        {
          "content": "Back to Marketplace and then into Solaris Temple."
        },
        {
          "content": "The entrance is north, east of the entrance to the Docks."
        },
        {
          "content": "Run through Solaris Temple level 1 and 2 and talk to Dalia to finish quest."
        }
      ]
    },
    {
      "act": 3,
      "step": 32,
      "substeps": [
        {
          "content": "Now back to Sewers and open the passage left of the waypoint. Go to Ebony Barracks."
        },
        {
          "content": "Run northwest and kill Gravicious, afterwards head west to Lunaris Temple."
        },
        {
          "content": "Run through the Lunaris Temple level 2 and kill Piety for the Tower Key."
        },
        {
          "content": "Go back to town to get gem rewards, if you need any for your build."
        },
        {
          "content": "There is also a skill point reward at Grigor."
        }
      ],
      "quest": "Sever the Right Hand"
    },
    {
      "act": 3,
      "step": 33,
      "substeps": [
        {
          "content": "Back to The Ebony Barracks and head east to the Imperial Gardens."
        },
        {
          "content": "In the Imperial Gardens follow the road until you find the waypoint"
        },
        {
          "content": "From the waypoint take to path upwards to enter the Library if you need gems from the quest there."
        },
        {
          "content": "In the Library find the loose Candle to enter the Archives."
        },
        {
          "content": "In the Archives find the 4 Golden Pages and bring them to Siosa to unlock him as a gem vendor."
        }
      ],
      "quest": "A Fixture of Fate"
    },
    {
      "act": 3,
      "step": 34,
      "substeps": [
        {
          "content": "Back to Imperial Gardens and finish your Lab Trial in the upper right of the area."
        }
      ]
    },
    {
      "act": 3,
      "step": 35,
      "substeps": [
        {
          "content": "Go do your Lab now since it will make fighting Dominus much easier."
        }
      ]
    },
    {
      "act": 3,
      "step": 36,
      "substeps": [
        {
          "content": "Back to Imperial Gardens and take the right path to the Scepter of God."
        },
        {
          "content": "Ascend the Scepter of God until you reach the roof. Kill Dominus"
        },
        {
          "content": "Exit to Act 4"
        }
      ]
    },
    {
      "act": 4,
      "step": 37,
      "substeps": [
        {
          "content": "Travel through the Aqueduct until you enter Highgate."
        }
      ]
    },
    {
      "act": 4,
      "step": 38,
      "substeps": [
        {
          "content": "Enter the town and go left to the Dried Lake."
        },
        {
          "content": "Kill Voll (and get the attack/cast speed crafting recipe)"
        },
        {
          "content": "Unlocking the mines unlocks some skill gems after talking to Oyun"
        },
        {
          "content": "Enter the mine after"
        }
      ],
      "quest": "Breaking The Seal"
    },
    {
      "act": 4,
      "step": 39,
      "substeps": [
        {
          "content": "Consider doing your first Delve after hitting sulphite to get the 2-3 Socket Recipe from the first Delve Node."
        }
      ]
    },
    {
      "act": 4,
      "step": 40,
      "substeps": [
        {
          "content": "In the mines level 2 find Deshret's Spirit and release it for a skill point in town."
        }
      ]
    },
    {
      "act": 4,
      "step": 41,
      "substeps": [
        {
          "content": "Travel through the Crystal Veins to the waypoint, then complete both side areas in any order."
        },
        {
          "content": "After both are completed, new gems are unlocked in town."
        }
      ],
      "quest": "The Eternal Nightmare"
    },
    {
      "act": 4,
      "step": 42,
      "substeps": [
        {
          "content": "Enter the Belly of the Beast and travel through level 1 and 2."
        },
        {
          "content": "Continue to the Bowels of the Beast and defeat Piety."
        },
        {
          "content": "Enter The Harvest and get the waypoint."
        }
      ]
    },
    {
      "act": 4,
      "step": 43,
      "substeps": [
        {
          "content": "In The Harvest go in a circle and kill the 3 bosses to get the organs"
        },
        {
          "content": "Enter The Black Core when you have all 3 organs."
        },
        {
          "content": "Kill Malachai and get back to Highgate."
        }
      ]
    },
    {
      "act": 4,
      "step": 44,
      "substeps": [
        {
          "content": "From Town exit to The Ascent in the upper right part of town"
        },
        {
          "content": "Travel through The Ascent and interact with the resonator."
        },
        {
          "content": "Take the Oriath Portal to exit into Act 5."
        }
      ]
    },
    {
      "act": 5,
      "step": 45,
      "substeps": [
        {
          "content": "Travel through the Slave Pens and kill Overseer Crow"
        },
        {
          "content": "Ascend the ladder that drops after killing the Overseer and enter the Overseer's Tower."
        }
      ]
    },
    {
      "act": 5,
      "step": 46,
      "substeps": [
        {
          "content": "Head through the Control Blocks and grab the Miasmeter in the top left."
        },
        {
          "content": "Make your way up and right to the entrance to Oriath Square."
        },
        {
          "content": "On your way there kill Justicar Casticus and take the Eyes of Zeal."
        }
      ]
    },
    {
      "act": 5,
      "step": 47,
      "substeps": [
        {
          "content": "Run north east/east to the Templar Courts and get the waypoint."
        },
        {
          "content": "Return to town to get an Onslaught Flask."
        }
      ]
    },
    {
      "act": 5,
      "step": 48,
      "substeps": [
        {
          "content": "Head back to Templar Courts and run in a clockwise circle to The Chamber of Innocence."
        },
        {
          "content": "Run in a counter clockwise circle to kill the boss (grab the movement speed recipe on the way)."
        }
      ]
    },
    {
      "act": 5,
      "step": 49,
      "substeps": [
        {
          "content": "Head back through the Torched Courts after the fight to the Ruined Square."
        },
        {
          "content": "Here grab the Reliquary items to the south of the Square."
        },
        {
          "content": "Fetch the Sign of Purity from The Ossuary to the north-west."
        }
      ]
    },
    {
      "act": 5,
      "step": 50,
      "substeps": [
        {
          "content": "Head to town - update your flasks turn in your quest rewards (nothing important other than skill points)."
        },
        {
          "content": "Head to The Cathedral Rooftop to kill Kitava. You will suffer a permanent -30 resist penalty."
        }
      ]
    },
    {
      "act": 6,
      "step": 51,
      "substeps": [
        {
          "content": "First clear the Twilight Strand left of town to unlock Lilly as gem vendor for all gems"
        }
      ],
      "quest": "Fallen from Grace"
    }
  ]
}